In [15]:
import pandas as p

In [16]:
p.read_excel(r'C:\Users\kiran\OneDrive\Desktop\dataset1.xlsx')

     name  rollno.   batch address
0   kiran       77  python   dehli
1  diksha       55    java   noida
2     bob       98  python   delhi

In [17]:
p.read_csv(r'C:\Users\kiran\OneDrive\Desktop\dataset2.csv')

     name  rollno.   batch address
0   kiran       77  python   dehli
1  diksha       55    java   noida
2     bob       98  python   delhi
3     sas       33     c++   dehli
4     mac       45  python   noida

In [20]:
p.read_csv(r'C:\Users\kiran\OneDrive\Desktop\dataset3.tsv',sep='\t')

    name  roll no  batch no
0  amn   66       python-09
1        dab   43       c++
2  vv    64       python-08

In [22]:
p.read_csv(r'C:\Users\kiran\OneDrive\Desktop\dataset3.tsv',sep='\t')

    name  roll no  batch no
0  amn   66       python-09
1        dab   43       c++
2  vv    64       python-08

In [23]:
import os

In [24]:
os.getcwd()

'C:\\Users\\kiran'

In [26]:
import pandas as p

In [27]:
p.read_excel('Book1.xlsx')

    name  roll no.  batch no.   city
0  kiran        76  python 09    jpr
1  mithu        43       java  delhi
2    avi        21        c++  noida

In [28]:
p.read_csv('my data.tsv')

  name roll no class
0  aa    3    python
1       ss    4    c
2    dd    5    java